"use strict";

let result = 10 + 10 + "10";
console.log(result);
/*
1. 10 суммируем с 10 получаем 20
2. 20 конкатенируем с "10" получаем 2010
3. 2010 присваеваем в переменную result
4. с помощью console.log выводим result в консоль
*/

result = 10 + "10" + 10;
console.log(result);
/*
1. 10 конкатенируем с "10" получаем "1010"
2. "1010" конкатенируем с 10 получаем "101010"
3. "101010" присваеваем в переменную result
4. с помощью console.log выводим result в консоль
*/

result = 10 + 10 + +"10";
console.log(result);
/*
1. унарный плюс пререводит из строки "10" в число 10
2. 10 складываем с 10 получаем 20
3. 20 складываем с 10 получаем 30
4. 30 присваеваем в переменную result
5. с помощью console.log выводим result в консоль
*/

result = 10 / - "";
console.log(result);
/*
1. унарный минус выделяет из пустых кавычек значение получем -0
2. 10 делим на -0 получаем - Infinity
3. - Infinity присваеваем в переменную result
4. с помощью console.log выводим result в консоль
*/

result = 10 / + "2,5";
console.log(result);
/*
1. унарный плюс пытаеся выделить из строки "2,5" число, но не поддерживет запятые, после чего возвращает NaN
2. 10 делится на NaN получаем NaN
3. NaN присваеваем в переменную result
4. с помощью console.log выводим result в консоль
*/