"use strict";
//пример 1 
let a = 1, b = 1, c, d;
c = ++a;
alert(c); // ответ: 2 
/*
1. объявляем переменные a,b,c,d (при обявлении переменных, переменной "a" присваиваем значение 1, переменной "b" присваиваем значение 1, )
2. к значению переменной "a" прибавляем 1, получаем 2, присваемой переменной "с" значенние 2
3. с помощью alert выводим "с" на экран
*/

//пример 2 
d = (b++);
alert(d); //ответ: 1 
/*
4. к значению переменной "b" прибавляем 1, получаем 2, но присваиваем переменной "с" значение пременной "b" до +1  
5. с помощью alert выводим "d" на экран 
*/

//пример 3 
c = 2 + ++a;
alert(c); //ответ: 5 
/*
6. к значению переменной "a" прибавляем 1, получаем 3, суммируем с 2 получаем 5 данное значение помещаем в переменную "c"
7. с помощью alert выводим "c" на экран 
*/

//пример 4 
d = 2 + b++;
alert(d); //ответ: 4 
alert(a); //3 
alert(b); //3
/*
8. к значению переменной "b" 2 прибавляем 1 получаем 3, далее 2 суммируем с предыдущим значением преременной "b" 2  получаем 4 данное значение помещаем в переменную "d"
9. с помощью alert выводим "d" на экран 4 
10. с помощью alert выводим "a" на экран 3 (значение полученное в результатах предыдущих вычислений)
11. с помощью alert выводим "b" на экран 3 (значение полученное в результатах предыдущих вычислений)
*/